"""
线性代数：
    高等教育中理工科学生必学的数学。
    线性代数是近现代科学发展过程中最重要的基础数学之一。
    初等教育中的代数更多的是在研究一个数。
    线性代数则在研究"一组数"，即向量。
    研究“一组数”的原因：
        真实的世界是多维度的
        单变量不足以描述真实世界
        用单变量描述真实世界是不方便的
    线性代数是相对容易的，在低维空间很容易看到线性代数结论的直观几何意义。
    对线性代数的直观理解，决定了对基础概念的认识深度，决定了能否理解高级概念。
    但不能抹杀数学计算训练的意义。
    证明练习是数学学习非常重要的一环，线性代数本身逻辑性很强，一环扣一环，每一个结论都可以严格证明。

怎么学习数学：
    1.对数学概念，不做生硬的定义
    2.为什么引入这个概念
    3.引入这个概念是为了解决什么问题
    4.一些推论为什么是重要的

线性代数的应用：
    图形学、推荐系统、人工智能、搜索引擎等

线性代数与机器学习：
    入门机器学习，不一定要把数学先学透
    基础的高数、线代、概率达到及格水平即可入门机器学习
    入门机器学习后，有目的来补数学，效果更好

    线性代数只是机器学习所涉及的数学的一方面，还有高等数学、统计学(统计学习)、凸优化、其他(组合数学)等
    心里障碍大于数学实际掌握水平，学习机器学习，不一定要把数学先学透
    书籍：花书
"""